# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaCommon..::..Description Property
SchemaCommon Class See Also
---
The property labeled "Description" common to all visual Asset types.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string Description { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
static property String^ Description {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyString".
# See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace